In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(10)
# quantidade de observações
n = 100

escolaridade = ['Ensino Fundamental', 'Ensino Médio', 'Ensino Superior']

cidades = ['São Paulo', 'Recife', 'Salvador', 'Salvador', 'Rio de Janeiro']

sexo = ['Masculino', 'Feminino']


# dicionário com dados
data = {
    'Id': np.arange(1, n+1),
    'Idade': np.random.randint(18, 70, size = n),
    'Renda': np.random.randint(1_500, 10_000, size = n),
    'Sexo': np.random.choice(sexo, size = n),
    'Escolaridade': np.random.choice(escolaridade, size = n),
    'Cidade': np.random.choice(cidades, size = n)
}

df = pd.DataFrame(data)

In [5]:
df

     Id  Idade  Renda       Sexo        Escolaridade          Cidade
0     1     27   4297  Masculino        Ensino Médio       São Paulo
1     2     54   7957   Feminino     Ensino Superior          Recife
2     3     33   6343   Feminino  Ensino Fundamental        Salvador
3     4     18   4366   Feminino  Ensino Fundamental        Salvador
4     5     67   4105   Feminino  Ensino Fundamental          Recife
..  ...    ...    ...        ...                 ...             ...
95   96     67   2958  Masculino        Ensino Médio          Recife
96   97     33   5068  Masculino     Ensino Superior          Recife
97   98     62   7176  Masculino        Ensino Médio        Salvador
98   99     58   2375   Feminino     Ensino Superior  Rio de Janeiro
99  100     60   4265  Masculino  Ensino Fundamental        Salvador

[100 rows x 6 columns]

In [6]:
df.describe()

               Id       Idade        Renda
count  100.000000  100.000000   100.000000
mean    50.500000   43.140000  5885.120000
std     29.011492   14.227602  2328.749998
min      1.000000   18.000000  1912.000000
25%     25.750000   31.000000  3858.500000
50%     50.500000   42.000000  5944.500000
75%     75.250000   54.000000  7961.250000
max    100.000000   69.000000  9978.000000

In [7]:
df.describe().T

       count     mean          std     min      25%     50%      75%     max
Id     100.0    50.50    29.011492     1.0    25.75    50.5    75.25   100.0
Idade  100.0    43.14    14.227602    18.0    31.00    42.0    54.00    69.0
Renda  100.0  5885.12  2328.749998  1912.0  3858.50  5944.5  7961.25  9978.0

In [8]:
df.describe(include='all').T #faz tbm de colunas categoricas

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Id,100.0,NaN,NaN,NaN,50.5,29.011492,1.0,25.75,50.5,75.25,100.0
Idade,100.0,NaN,NaN,NaN,43.14,14.227602,18.0,31.0,42.0,54.0,69.0
Renda,100.0,NaN,NaN,NaN,5885.12,2328.749998,1912.0,3858.5,5944.5,7961.25,9978.0
Sexo,100,2,Masculino,51,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Escolaridade,100,3,Ensino Médio,36,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Cidade,100,4,Salvador,46,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df_especifico = df[['Idade', 'Renda']]

In [4]:
df_especifico.mad() #desvio medio absoluto

Idade      11.9340
Renda    1979.6328
dtype: float64

In [5]:
df.Cidade.mode()

0    Salvador
Name: Cidade, dtype: object

In [6]:
df.Renda.quantile([0.25,0.75]) #mostra quartil 1 e 3

0.25    3858.50
0.75    7961.25
Name: Renda, dtype: float64

In [7]:
df_especifico.cov() #covariancia: associacao entre variaveis quantitivas

            Idade         Renda
Idade  202.424646 -7.693806e+02
Renda -769.380606  5.423077e+06

In [8]:
df_especifico.corr() #correlacao de pearson

          Idade     Renda
Idade  1.000000 -0.023221
Renda -0.023221  1.000000

In [10]:
df.Idade.describe()

count    100.000000
mean      43.140000
std       14.227602
min       18.000000
25%       31.000000
50%       42.000000
75%       54.000000
max       69.000000
Name: Idade, dtype: float64

In [11]:
def hl(data):
    if data.mean() < 35:
        return 'jovem'
    return 'adulto'

In [13]:
df['Idade']

0     27
1     54
2     33
3     18
4     67
      ..
95    67
96    33
97    62
98    58
99    60
Name: Idade, Length: 100, dtype: int64

In [21]:
df['Idade'].agg(hl)

'adulto'

In [22]:
df[['Idade']].agg(hl, axis=1)

0      jovem
1     adulto
2      jovem
3      jovem
4     adulto
       ...
95    adulto
96     jovem
97    adulto
98    adulto
99    adulto
Length: 100, dtype: object

In [23]:
df_especifico.rename(columns= lambda c: c.lower())

    idade  renda
0      27   4297
1      54   7957
2      33   6343
3      18   4366
4      67   4105
..    ...    ...
95     67   2958
96     33   5068
97     62   7176
98     58   2375
99     60   4265

[100 rows x 2 columns]